<?xml version="1.0" encoding="UTF-8"?>
<net name="vd-net-caffe" version="6" batch="1">
	<layers>
		<layer name="data" type="Input" precision="FP32" id="0">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
			</output>
		</layer>
		<layer name="Mul_/Fused_Mul_/FusedScaleShift_" type="ScaleShift" precision="FP32" id="1">
			<data broadcast="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
			</output>
			<blobs>
				<biases offset="0" size="12"/>
				<weights offset="12" size="12"/>
			</blobs>
		</layer>
		<layer name="conv1" type="Convolution" precision="FP32" id="2">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
			<blobs>
				<biases offset="24" size="128"/>
				<weights offset="152" size="3456"/>
			</blobs>
		</layer>
		<layer name="relu1" type="ReLU" precision="FP32" id="3">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer name="conv2_1/dw" type="Convolution" precision="FP32" id="4">
			<data dilations="1,1" group="32" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3608" size="128"/>
				<weights offset="3736" size="1152"/>
			</blobs>
		</layer>
		<layer name="relu2_1/dw" type="ReLU" precision="FP32" id="5">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer name="conv2_1/sep" type="Convolution" precision="FP32" id="6">
			<data dilations="1,1" group="1" kernel="1,1" output="56" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>56</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
			<blobs>
				<biases offset="4888" size="224"/>
				<weights offset="5112" size="7168"/>
			</blobs>
		</layer>
		<layer name="relu2_1/sep" type="ReLU" precision="FP32" id="7">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>56</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</output>
		</layer>
		<layer name="conv2_2/dw" type="Convolution" precision="FP32" id="8">
			<data dilations="1,1" group="56" kernel="3,3" output="56" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>192</dim>
					<dim>336</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>56</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
			<blobs>
				<biases offset="12280" size="224"/>
				<weights offset="12504" size="2016"/>
			</blobs>
		</layer>
		<layer name="relu2_2/dw" type="ReLU" precision="FP32" id="9">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>56</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer name="conv2_2/sep" type="Convolution" precision="FP32" id="10">
			<data dilations="1,1" group="1" kernel="1,1" output="112" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>56</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
			<blobs>
				<biases offset="14520" size="448"/>
				<weights offset="14968" size="25088"/>
			</blobs>
		</layer>
		<layer name="relu2_2/sep" type="ReLU" precision="FP32" id="11">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer name="conv3_1/dw" type="Convolution" precision="FP32" id="12">
			<data dilations="1,1" group="112" kernel="3,3" output="112" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
			<blobs>
				<biases offset="40056" size="448"/>
				<weights offset="40504" size="4032"/>
			</blobs>
		</layer>
		<layer name="relu3_1/dw" type="ReLU" precision="FP32" id="13">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer name="conv3_1/sep" type="Convolution" precision="FP32" id="14">
			<data dilations="1,1" group="1" kernel="1,1" output="112" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
			<blobs>
				<biases offset="44536" size="448"/>
				<weights offset="44984" size="50176"/>
			</blobs>
		</layer>
		<layer name="relu3_1/sep" type="ReLU" precision="FP32" id="15">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</output>
		</layer>
		<layer name="conv3_2/dw" type="Convolution" precision="FP32" id="16">
			<data dilations="1,1" group="112" kernel="3,3" output="112" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>96</dim>
					<dim>168</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<biases offset="95160" size="448"/>
				<weights offset="95608" size="4032"/>
			</blobs>
		</layer>
		<layer name="relu3_2/dw" type="ReLU" precision="FP32" id="17">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer name="conv3_2/sep" type="Convolution" precision="FP32" id="18">
			<data dilations="1,1" group="1" kernel="1,1" output="208" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>208</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<biases offset="99640" size="832"/>
				<weights offset="100472" size="93184"/>
			</blobs>
		</layer>
		<layer name="relu3_2/sep" type="ReLU" precision="FP32" id="19">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>208</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>208</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer name="conv4_1/dw" type="Convolution" precision="FP32" id="20">
			<data dilations="1,1" group="208" kernel="3,3" output="208" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>208</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>208</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<biases offset="193656" size="832"/>
				<weights offset="194488" size="7488"/>
			</blobs>
		</layer>
		<layer name="relu4_1/dw" type="ReLU" precision="FP32" id="21">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>208</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>208</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer name="conv4_1/sep" type="Convolution" precision="FP32" id="22">
			<data dilations="1,1" group="1" kernel="1,1" output="216" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>208</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>216</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<biases offset="201976" size="864"/>
				<weights offset="202840" size="179712"/>
			</blobs>
		</layer>
		<layer name="relu4_1/sep" type="ReLU" precision="FP32" id="23">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>216</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>216</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer name="conv4_2/dw" type="Convolution" precision="FP32" id="24">
			<data dilations="1,1" group="216" kernel="3,3" output="216" pads_begin="1,1" pads_end="1,1" quantization_level="FP32" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>216</dim>
					<dim>48</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>216</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<biases offset="382552" size="864"/>
				<weights offset="383416" size="7776"/>
			</blobs>
		</layer>
		<layer name="relu4_2/dw" type="ReLU" precision="FP32" id="25">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>216</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>216</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer name="conv4_2/sep" type="Convolution" precision="FP32" id="26">
			<data dilations="1,1" group="1" kernel="1,1" output="328" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>216</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>328</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<biases offset="391192" size="1312"/>
				<weights offset="392504" size="283392"/>
			</blobs>
		</layer>
		<layer name="relu4_2/sep" type="ReLU" precision="FP32" id="27">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>328</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>328</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer name="conv5_1/dw" type="Convolution" precision="FP32" id="28">
			<data dilations="1,1" group="328" kernel="3,3" output="328" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>328</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>328</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<biases offset="675896" size="1312"/>
				<weights offset="677208" size="11808"/>
			</blobs>
		</layer>
		<layer name="relu5_1/dw" type="ReLU" precision="FP32" id="29">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>328</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>328</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer name="conv5_1/sep" type="Convolution" precision="FP32" id="30">
			<data dilations="1,1" group="1" kernel="1,1" output="288" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>328</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<biases offset="689016" size="1152"/>
				<weights offset="690168" size="377856"/>
			</blobs>
		</layer>
		<layer name="relu5_1/sep" type="ReLU" precision="FP32" id="31">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer name="conv5_2/dw" type="Convolution" precision="FP32" id="32">
			<data dilations="1,1" group="288" kernel="3,3" output="288" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1068024" size="1152"/>
				<weights offset="1069176" size="10368"/>
			</blobs>
		</layer>
		<layer name="relu5_2/dw" type="ReLU" precision="FP32" id="33">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer name="conv5_2/sep" type="Convolution" precision="FP32" id="34">
			<data dilations="1,1" group="1" kernel="1,1" output="288" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1079544" size="1152"/>
				<weights offset="1080696" size="331776"/>
			</blobs>
		</layer>
		<layer name="relu5_2/sep" type="ReLU" precision="FP32" id="35">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer name="conv5_3/dw" type="Convolution" precision="FP32" id="36">
			<data dilations="1,1" group="288" kernel="3,3" output="288" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1412472" size="1152"/>
				<weights offset="1413624" size="10368"/>
			</blobs>
		</layer>
		<layer name="relu5_3/dw" type="ReLU" precision="FP32" id="37">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer name="conv5_3/sep" type="Convolution" precision="FP32" id="38">
			<data dilations="1,1" group="1" kernel="1,1" output="240" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>288</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>240</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1423992" size="960"/>
				<weights offset="1424952" size="276480"/>
			</blobs>
		</layer>
		<layer name="relu5_3/sep" type="ReLU" precision="FP32" id="39">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>240</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer name="conv5_4/dw" type="Convolution" precision="FP32" id="40">
			<data dilations="1,1" group="240" kernel="3,3" output="240" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>240</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1701432" size="960"/>
				<weights offset="1702392" size="8640"/>
			</blobs>
		</layer>
		<layer name="relu5_4/dw" type="ReLU" precision="FP32" id="41">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>240</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer name="conv5_4/sep" type="Convolution" precision="FP32" id="42">
			<data dilations="1,1" group="1" kernel="1,1" output="264" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>240</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>264</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1711032" size="1056"/>
				<weights offset="1712088" size="253440"/>
			</blobs>
		</layer>
		<layer name="relu5_4/sep" type="ReLU" precision="FP32" id="43">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>264</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>264</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer name="conv5_5/dw" type="Convolution" precision="FP32" id="44">
			<data dilations="1,1" group="264" kernel="3,3" output="264" pads_begin="1,1" pads_end="1,1" quantization_level="FP32" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>264</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>264</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1965528" size="1056"/>
				<weights offset="1966584" size="9504"/>
			</blobs>
		</layer>
		<layer name="relu5_5/dw" type="ReLU" precision="FP32" id="45">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>264</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>264</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer name="conv5_5/sep" type="Convolution" precision="FP32" id="46">
			<data dilations="1,1" group="1" kernel="1,1" output="192" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>264</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
			<blobs>
				<biases offset="1976088" size="768"/>
				<weights offset="1976856" size="202752"/>
			</blobs>
		</layer>
		<layer name="relu5_5/sep" type="ReLU" precision="FP32" id="47">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</output>
		</layer>
		<layer name="conv5_6/dw" type="Convolution" precision="FP32" id="48">
			<data dilations="1,1" group="192" kernel="3,3" output="192" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>24</dim>
					<dim>42</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2179608" size="768"/>
				<weights offset="2180376" size="6912"/>
			</blobs>
		</layer>
		<layer name="relu5_6/dw" type="ReLU" precision="FP32" id="49">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer name="conv5_6/sep" type="Convolution" precision="FP32" id="50">
			<data dilations="1,1" group="1" kernel="1,1" output="208" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>208</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2187288" size="832"/>
				<weights offset="2188120" size="159744"/>
			</blobs>
		</layer>
		<layer name="relu5_6/sep" type="ReLU" precision="FP32" id="51">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>208</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>208</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer name="conv6/dw" type="Convolution" precision="FP32" id="52">
			<data dilations="1,1" group="208" kernel="3,3" output="208" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>208</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>208</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2347864" size="832"/>
				<weights offset="2348696" size="7488"/>
			</blobs>
		</layer>
		<layer name="relu6/dw" type="ReLU" precision="FP32" id="53">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>208</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>208</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer name="conv6/sep" type="Convolution" precision="FP32" id="54">
			<data dilations="1,1" group="1" kernel="1,1" output="88" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>208</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>88</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2356184" size="352"/>
				<weights offset="2356536" size="73216"/>
			</blobs>
		</layer>
		<layer name="relu6/sep" type="ReLU" precision="FP32" id="55">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>88</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer name="fc7_mbox_priorbox" type="PriorBox" precision="FP32" id="56">
			<data aspect_ratio="2.0,3.0" clip="0" density="" fixed_ratio="" fixed_size="" flip="1" max_size="172.8000030517578" min_size="124.80000305175781" offset="0.5" step="32.0" variance="0.10000000149011612,0.10000000149011612,0.20000000298023224,0.20000000298023224"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>2</dim>
					<dim>6048</dim>
				</port>
			</output>
		</layer>
		<layer name="fc7_mbox_loc" type="Convolution" precision="FP32" id="57">
			<data dilations="1,1" group="1" kernel="3,3" output="24" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2429752" size="96"/>
				<weights offset="2429848" size="76032"/>
			</blobs>
		</layer>
		<layer name="fc7_mbox_loc_perm" type="Permute" precision="FP32" id="58">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>12</dim>
					<dim>21</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer name="fc7_mbox_loc_flat" type="Flatten" precision="FP32" id="59">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>21</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>6048</dim>
				</port>
			</output>
		</layer>
		<layer name="fc7_mbox_conf" type="Convolution" precision="FP32" id="60">
			<data dilations="1,1" group="1" kernel="3,3" output="12" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>12</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2505880" size="48"/>
				<weights offset="2505928" size="38016"/>
			</blobs>
		</layer>
		<layer name="fc7_mbox_conf_perm" type="Permute" precision="FP32" id="61">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>12</dim>
					<dim>21</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer name="fc7_mbox_conf_flat" type="Flatten" precision="FP32" id="62">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>21</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3024</dim>
				</port>
			</output>
		</layer>
		<layer name="fc7_0_mbox_priorbox" type="PriorBox" precision="FP32" id="63">
			<data aspect_ratio="2.0,3.0" clip="0" density="" fixed_ratio="" fixed_size="" flip="1" max_size="124.80000305175781" min_size="76.80000305175781" offset="0.5" step="32.0" variance="0.10000000149011612,0.10000000149011612,0.20000000298023224,0.20000000298023224"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>2</dim>
					<dim>6048</dim>
				</port>
			</output>
		</layer>
		<layer name="fc7_0_mbox_loc" type="Convolution" precision="FP32" id="64">
			<data dilations="1,1" group="1" kernel="3,3" output="24" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2543944" size="96"/>
				<weights offset="2544040" size="76032"/>
			</blobs>
		</layer>
		<layer name="fc7_0_mbox_loc_perm" type="Permute" precision="FP32" id="65">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>12</dim>
					<dim>21</dim>
					<dim>24</dim>
				</port>
			</output>
		</layer>
		<layer name="fc7_0_mbox_loc_flat" type="Flatten" precision="FP32" id="66">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>21</dim>
					<dim>24</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>6048</dim>
				</port>
			</output>
		</layer>
		<layer name="fc7_0_mbox_conf" type="Convolution" precision="FP32" id="67">
			<data dilations="1,1" group="1" kernel="3,3" output="12" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>12</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2620072" size="48"/>
				<weights offset="2620120" size="38016"/>
			</blobs>
		</layer>
		<layer name="fc7_0_mbox_conf_perm" type="Permute" precision="FP32" id="68">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>12</dim>
					<dim>21</dim>
					<dim>12</dim>
				</port>
			</output>
		</layer>
		<layer name="fc7_0_mbox_conf_flat" type="Flatten" precision="FP32" id="69">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>12</dim>
					<dim>21</dim>
					<dim>12</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3024</dim>
				</port>
			</output>
		</layer>
		<layer name="conv6_1" type="Convolution" precision="FP32" id="70">
			<data dilations="1,1" group="1" kernel="1,1" output="96" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>88</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2658136" size="384"/>
				<weights offset="2658520" size="33792"/>
			</blobs>
		</layer>
		<layer name="relu6_1" type="ReLU" precision="FP32" id="71">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</output>
		</layer>
		<layer name="conv6_2/dw" type="Convolution" precision="FP32" id="72">
			<data dilations="1,1" group="96" kernel="3,3" output="96" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>12</dim>
					<dim>21</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2692312" size="384"/>
				<weights offset="2692696" size="3456"/>
			</blobs>
		</layer>
		<layer name="relu6_2/dw" type="ReLU" precision="FP32" id="73">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</output>
		</layer>
		<layer name="conv6_2" type="Convolution" precision="FP32" id="74">
			<data dilations="1,1" group="1" kernel="1,1" output="152" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>152</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2696152" size="608"/>
				<weights offset="2696760" size="58368"/>
			</blobs>
		</layer>
		<layer name="relu6_2" type="ReLU" precision="FP32" id="75">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>152</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>152</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</output>
		</layer>
		<layer name="conv7_1" type="Convolution" precision="FP32" id="76">
			<data dilations="1,1" group="1" kernel="1,1" output="112" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>152</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2755128" size="448"/>
				<weights offset="2755576" size="68096"/>
			</blobs>
		</layer>
		<layer name="relu7_1" type="ReLU" precision="FP32" id="77">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</output>
		</layer>
		<layer name="conv7_2/dw" type="Convolution" precision="FP32" id="78">
			<data dilations="1,1" group="112" kernel="3,3" output="112" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>6</dim>
					<dim>11</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2823672" size="448"/>
				<weights offset="2824120" size="4032"/>
			</blobs>
		</layer>
		<layer name="relu7_2/dw" type="ReLU" precision="FP32" id="79">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>112</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer name="conv7_2" type="Convolution" precision="FP32" id="80">
			<data dilations="1,1" group="1" kernel="1,1" output="200" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>112</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>200</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2828152" size="800"/>
				<weights offset="2828952" size="89600"/>
			</blobs>
		</layer>
		<layer name="relu7_2" type="ReLU" precision="FP32" id="81">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>200</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>200</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer name="conv8_1" type="Convolution" precision="FP32" id="82">
			<data dilations="1,1" group="1" kernel="1,1" output="120" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>200</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>120</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</output>
			<blobs>
				<biases offset="2918552" size="480"/>
				<weights offset="2919032" size="96000"/>
			</blobs>
		</layer>
		<layer name="relu8_1" type="ReLU" precision="FP32" id="83">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>120</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer name="conv8_2/dw" type="Convolution" precision="FP32" id="84">
			<data dilations="1,1" group="120" kernel="3,3" output="120" pads_begin="1,1" pads_end="1,1" quantization_level="FP32" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>3</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>120</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3015032" size="480"/>
				<weights offset="3015512" size="4320"/>
			</blobs>
		</layer>
		<layer name="relu8_2/dw" type="ReLU" precision="FP32" id="85">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>120</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer name="conv8_2" type="Convolution" precision="FP32" id="86">
			<data dilations="1,1" group="1" kernel="1,1" output="224" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>120</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>224</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3019832" size="896"/>
				<weights offset="3020728" size="107520"/>
			</blobs>
		</layer>
		<layer name="relu8_2" type="ReLU" precision="FP32" id="87">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>224</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>224</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer name="conv9_1" type="Convolution" precision="FP32" id="88">
			<data dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>224</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3128248" size="256"/>
				<weights offset="3128504" size="57344"/>
			</blobs>
		</layer>
		<layer name="relu9_1" type="ReLU" precision="FP32" id="89">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer name="conv9_2/dw" type="Convolution" precision="FP32" id="90">
			<data dilations="1,1" group="64" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3185848" size="256"/>
				<weights offset="3186104" size="2304"/>
			</blobs>
		</layer>
		<layer name="relu9_2/dw" type="ReLU" precision="FP32" id="91">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer name="conv9_2" type="Convolution" precision="FP32" id="92">
			<data dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3188408" size="512"/>
				<weights offset="3188920" size="32768"/>
			</blobs>
		</layer>
		<layer name="relu9_2" type="ReLU" precision="FP32" id="93">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer name="conv9_2_mbox_priorbox" type="PriorBox" precision="FP32" id="94">
			<data aspect_ratio="2.0" clip="0" density="" fixed_ratio="" fixed_size="" flip="1" max_size="403.20001220703125" min_size="345.6000061035156" offset="0.5" variance="0.10000000149011612,0.10000000149011612,0.20000000298023224,0.20000000298023224"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>2</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="conv9_2_mbox_loc" type="Convolution" precision="FP32" id="95">
			<data dilations="1,1" group="1" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3221688" size="64"/>
				<weights offset="3221752" size="73728"/>
			</blobs>
		</layer>
		<layer name="conv9_2_mbox_loc_perm" type="Permute" precision="FP32" id="96">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer name="conv9_2_mbox_loc_flat" type="Flatten" precision="FP32" id="97">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer name="conv9_2_mbox_conf" type="Convolution" precision="FP32" id="98">
			<data dilations="1,1" group="1" kernel="3,3" output="8" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3295480" size="32"/>
				<weights offset="3295512" size="36864"/>
			</blobs>
		</layer>
		<layer name="conv9_2_mbox_conf_perm" type="Permute" precision="FP32" id="99">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer name="conv9_2_mbox_conf_flat" type="Flatten" precision="FP32" id="100">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer name="conv8_2_mbox_priorbox" type="PriorBox" precision="FP32" id="101">
			<data aspect_ratio="2.0" clip="0" density="" fixed_ratio="" fixed_size="" flip="1" max_size="345.6000061035156" min_size="288.0" offset="0.5" variance="0.10000000149011612,0.10000000149011612,0.20000000298023224,0.20000000298023224"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>224</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>672</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>2</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer name="conv8_2_mbox_loc" type="Convolution" precision="FP32" id="102">
			<data dilations="1,1" group="1" kernel="3,3" output="16" pads_begin="1,1" pads_end="1,1" quantization_level="I8" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>224</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<biases offset="3332376" size="64"/>
				<weights offset="3332440" size="129024"/>
			</blobs>
		</layer>
		<layer name="conv8_2_mbox_loc_perm" type="Permute" precision="FP32" id="103">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
